In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv(r"KNNData.csv")

In [3]:
data.head()

     Name  Age Gender     Sport
0    Ajay   32      M  Football
1    Mark   40      M   Neither
2    Sara   16      F   Cricket
3   Zaira   34      F   Cricket
4  Sachin   55      M   Neither

In [ ]:
##Converting Gender to